questions_by_topic = {
    "traffic": [
        """1. קטע הכביש שבין יישוב A ליישוב B מחולק לשניים: קטע כביש עירוני וקטע כביש מהיר.
        האורך של קטע הכביש המהיר גדול פי 7 מן האורך של קטע הכביש העירוני.
        שתי מכוניות א' וב' יצאו באותה השעה ונסעו זו לקראת זו: מכונית א' יצאה מיישוב B ומכונית ב' יצאה מיישוב A.
        במשך כל אותו היום מהירות הנסיעה של כל אחת מן המכוניות בקטע הכביש המהיר הייתה קבועה וגדולה פי 2 ממהירות הנסיעה שלה בקטע הכביש העירוני.
        המכוניות נפגשו באמצע הקטע AB.
        א. מצאו פי כמה גדולה מהירות הנסיעה של מכונית א' בקטע הכביש המהיר ממהירות הנסיעה של מכונית ב' בקטע הכביש המהיר.
        ב. כאשר הגיעה מכונית א' ליישוב B, הייתה מכונית ב' בקטע הכביש העירוני, במרחק 18 ק"מ מיישוב A. מצאו את המרחק בין יישוב A ובין יישוב B.
        ג. כאשר הגיעה מכונית א' ליישוב B היא מייד יצאה חזרה לכיוון היישוב A, וכאשר הגיעה מכונית ב' ליישוב A היא מייד יצאה חזרה לכיוון היישוב B.
        בדרכן חזרה נפגשו המכוניות בקטע הכביש המהיר. מצאו באיזה מרחק מן היישוב B נפגשו המכוניות בדרכן חזרה.""",
        """8. נתונה הפונקציה f(x) = 1 − x².
        א(1). מצאו את תחום ההגדרה של הפונקציה.
        א(2). מצאו את תחומי החיוביות והשליליות של הפונקציה.
        ב. ידוע כי לפונקציה f(x) יש נקודת קיצון פנימית אחת ואין לה נקודות פיתול.
        סרטטו סקיצה של גרף הפונקציה.
        ג. הנקודה A נמצאת ברביע הראשון על גרף הפונקציה f(x).
        הנקודה C היא נקודת החיתוך של גרף הפונקציה עם החלק החיובי של ציר ה-x.
        מן הנקודה A העבירו שני אנכים:
        אחד לציר ה-x החותך אותו בנקודה B,
        ואנך נוסף לישר x = 1, החותך אותו בנקודה D.
        מצאו את שיעורי הנקודה A שבעבורה היקף המלבן ABCD הוא מקסימלי."""
    ],
    "series": [
        """2. נתונה סדרה הנדסית A שאיבריה הם a₁, a₂, a₃, ..., aₘ ובה m איברים (m הוא מספר טבעי גדול מ־4). כל איברי הסדרה A הם שליליים.
        נתון: סכום m−4 האיברים האחרונים בסדרה הוא פי 16 מסכום 4 האיברים הראשונים בסדרה.
        א(1). מצאו את מנת הסדרה.
        א(2). האם הסדרה A עולה, יורדת או לא עולה ולא יורדת? נמקו את תשובתכם.
        המשיכו את הסדרה A כך שנוצרה סדרה הנדסית אין־סופית.
        נתונה סדרה אין־סופית B שאיבריה מקיימים: bₙ = aₙ / kⁿ, כאשר k הוא פרמטר שונה מ־0 ולכל n טבעי.
        ב. הוכיחו כי הסדרה B היא סדרה הנדסית, והביעו את המנה שלה באמצעות k.
        ג. נתון כי סכום הסדרה B מתכנס. מצאו את תחום הערכים האפשרי של k.
        ד. נתון: מנת הסדרה B היא 1/4, סכום הסדרה הוא 9−. מצאו את הערך של b₁ ואת הערך של k.
        ה. בסדרה B מחקו כל איבר שלישי (b₃, b₆, b₉, ...). מצאו את סכום האיברים הנותרים.""",
        """בסדרה חשבונית A נתון:
        a₁ = 23 - 16k, a₄ = -41 - 4k. הקבוע k הוא פרמטר.
        א. מצאו עבור אילו ערכים של k:
        (1) הסדרה A עולה, (2) הסדרה A יורדת, (3) הסדרה A קבועה.
        נתון כי a₂₃ = -217.
        ב. מצאו את הערך של k.
        הציבו את הערך של k שמצאתם וענו על הסעיפים ג–ד.
        נתונה סדרה חדשה, B, שאיבריה מוגדרים כך: לכל n טבעי, bₙ = 24n² + 17n + a.
        ג. הוכיחו כי הסדרה B היא חשבונית.
        ד. חשבו את הסכום: b₁ - b₂ + b₃ - b₄ + ... + b₂₉ - b₃₀.""",
    ],
    "probability": [
        """3. בכד א' יש 10 כדורים אדומים ו־15 כדורים צהובים, ובכד ב' יש רק כדורים אדומים.
        דנה בוחרת באקראי כד ומוציאה ממנו באקראי כדור.
        אם הכדור צהוב, היא מוציאה באקראי כדור שני מאותו הכד (הוצאה ללא החזרה).
        אם הכדור הראשון אדום, היא מחזירה את הכדור לכד ושוב מוציאה באקראי כדור מאותו הכד.
        א. ידוע שדנה הוציאה שני כדורים באותו הצבע. מהי ההסתברות ששניהם צהובים?
        ב. דנה מחזירה לכד את הכדורים שהוציאה. יעל מבצעת את התהליך הזה:
        היא בוחרת באקראי כד, מוציאה ממנו באקראי כדור אחד ומחזירה אותו לכד.
        יעל חוזרת על תהליך זה עד שהיא מוציאה כדור אדום, מחזירה אותו לכד ומפסיקה להוציא כדורים.
        מצאו את ההסתברות שיעל ביצעה תהליך זה 6 פעמים בדיוק.
        ג. העבירו חלק מן הכדורים מכד ב' לכד א'. לאחר מכן בחרו באקראי כד והוציאו ממנו באקראי כדור אחד.
        נתון כי לאחר ההעברה ההסתברות שהכדור שהוציאו היה אדום היא 19/24.
        האם ייתכן שלפני ההעברה היו בכד ב' 10 כדורים? נמקו את תשובתכם.""",
        """ביישוב מסוים הוחלט לערוך סקר בנוגע להקמת פארק ביישוב.
        בסקר השתתפו תושבים מבוגרים וצעירים בלבד.
        כל אחד מן התושבים שהשתתף בסקר כתב אם הוא תומך בהקמת הפארק או מתנגד להקמתו (לא היו נמנעים).
        כל התושבים המבוגרים שהשתתפו בסקר תמכו בהקמת הפארק.
        בחרו באקראי בתושב אחד מבין התושבים שהשתתפו בסקר.
        נסמן ב־p את ההסתברות שהתושב שנבחר היה צעיר.
        נסמן ב־k את ההסתברות שהתושב שנבחר תמך בהקמת הפארק.
        א. הביעו באמצעות p ו־k את ההסתברות שהתושב שנבחר היה צעיר התומך בהקמת הפארק.
        מחצית מן התושבים הצעירים שהשתתפו בסקר תמכו בהקמת הפארק.
        3⁄7 מן המשתתפים בסקר שתמכו בהקמת הפארק היו צעירים.
        ב. מצאו את p ואת k.
        ג. יוסי, כתב חדשות מקומי, ריאיין באקראי 6 מן התושבים הצעירים שהשתתפו בסקר.
        מהי ההסתברות שלפחות אחד מהם תמך בהקמת הפארק ולפחות אחד מהם התנגד להקמת הפארק?
        ד. לאחר מכן ריאיין יוסי באקראי, בזה אחר זה, 5 תושבים שהשתתפו בסקר.
        מהי ההסתברות שבדיוק 3 מן המרואיינים האלה היו צעירים, ושהמרואיין האחרון מהם היה צעיר?"""
    ],
    "geometry": [
        """4. במרובע BKCD הצלע CD מקבילה לצלע KB. הצלע KB היא מיתר במעגל והצלע CD משיקה למעגל בנקודה K.
        הצלע BD חותכת את המעגל בנקודה A.
        האלכסון BC חותך את המיתר AK בנקודה E.
        א. הוכיחו כי ΔAKC ≅ ΔBKC.
        ב. הוכיחו כי CE / BE = AC / AB.
        ג. נתון: CE = 1/4 * BE. מצאו את היחס AK / AB.
        ד. נתון: שטח המרובע ABKC הוא 18. נסמן ב־S את שטח המשולש AEB, וב־R את שטח המשולש KEC.
        הביעו את S באמצעות R.""",
        """שני מעגלים נחתכים בנקודות A ו־C. B היא נקודה על המעגל הימני.
        המשכי הקטעים CA ו־CB חותכים את המעגל השמאלי בנקודות D ו־E בהתאמה.
        הנקודה F נמצאת על הקשת BC, כמתואר בסרטוט.
        המשכי הקטעים CF ו־DE נפגשים בנקודה G.
        נתון: AB⊥CE, AB=CB, AB=ED.
        א. הוכיחו: CB⊥EDA.
        ב. הוכיחו: המרובע GDAF הוא בר־חסימה במעגל.
        ג. נתון: AB=CH, AB=GE, CD/CG = DE/GE.
        הוכיחו: GE=CG.
        ד. נתון: CD=36, DE=18.
        חשבו את אורכי הקטעים CG ו־EG."""
    ],
    "trigonometry": [
        """5. נתון מעגל שמרכזו O ורדיוסו R.
        מן הנקודה A העבירו שני ישרים AB ו־AC המשיקים למעגל.
        הנקודה E היא נקודת ההשקה של הישר AC למעגל.
        נתון: AE = AO = BO = CE.
        נסמן ב־b את הזווית ∠BAC.
        א. הביעו את האורך של AB באמצעות R ו־b.
        ב. נתון כי האורך של AB הוא 2.5R והזווית ∠BAC היא זווית חדה.
        מצאו את הערך של b.
        ג. מצאו את היחס בין שטח המשולש AOB ובין שטח המשולש ABC.
        ד. נתון כי האורך של רדיוס המעגל החוסם את המשולש ABC הוא 8.
        מצאו את הערך של R.""",
        """נתון מעגל שמרכזו O והרדיוס שלו R.
        מנקודה E, הנמצאת מחוץ למעגל, העבירו ישר החותך את המעגל בנקודות A ו־B, כמתואר בסרטוט.
        הנקודה D נמצאת על הקשת הגדולה AB, כך שהקטע ED משיק למעגל.
        הנקודה C היא אמצע המיתר AB.
        נסמן את הזווית בין הרדיוסים OD ו־OA ב־2a (1a = 60°).
        נתון: המרחק של הנקודה O מן המיתר AB הוא 0.5R.
        א. הביעו באמצעות a את זוויות המרובע DOCE. אם יש צורך.
        ב. הביעו באמצעות R ו־a את אורך הקטע DE.
        ג. נתון כי רדיוס המעגל החוסם את המשולש AOD הוא 4R/7.
        מצאו את a.
        ד. מצאו את היחס בין שטח המעגל החוסם את המרובע DOCE ובין שטח המעגל הנתון."""
    ],
    "calculus": [
        """6. נתונה הפונקצייה f(x) = (x² − 4) / (x² − a²), כאשר a > 0.
        הפונקציה f(x) היא נגזרת של פונקציה אחרת.
        א. מצאו את תחום ההגדרה של הפונקציה f(x).
        ב. מצאו את תחומי העלייה והירידה של הפונקציה f(x).
        ג. נתון כי לפונקציה f(x) יש אסימפטוטה אופקית שמשוואתה y = 0.
        מצאו פונקציה f(x) המקיימת את התנאים.
        ד. נתונות הפונקציות הבאות:
        f(x) = (x² − 4) / (x² − a²), g(x) = x² / (x² − a²), h(x) = (x² − 2) / (x² − a²).
        לכל אחת מהפונקציות התאימו גרף מתאים מבין הגרפים I–IV.
        נמקו את תשובותיכם.
        ה. נתון כי לפונקציה h(x) יש אסימפטוטה אנכית במשוואה x = 0.25a.
        מצאו את הערך של a.""",
        """7. נתונה הפונקציה f(x) = cos(x²) + (2x / (x² − 3)), בתחום בו x² ≠ 3.
        a הוא פרמטר.
        א. מצאו את תחום ההגדרה של הפונקציה f(x).
        ב. האם הפונקציה f(x) היא זוגית או אי־זוגית? נמקו את תשובתכם.
        ג. נתון כי גרף הפונקציה f(x) משיק לישר y = 2 בשתי נקודות.
        מצאו את הערך של a.
        ד. הציבו a = 1 וענו על הסעיפים הבאים:
        מצאו את שיעורי נקודות הקיצון של הפונקציה f(x), וקבעו את סוגן.
        ה. סרטטו סקיצה של גרף הפונקציה f(x).
        ו. נתונות הפונקציות:
        g(x) = f(x) − k, h(x) = 1 / (x² − 3),
        k הוא פרמטר, k ∈ ℝ, מצאו את הערך של k שבעבורו גרף הפונקציה g(x) וגרף הפונקציה h(x) נפגשים בכל אחת מנקודות הקיצון שלהן.""",
        """8. נתונה הפונקציה f(x) = 1 − x².
        א(1). מצאו את תחום ההגדרה של הפונקציה.
        א(2). מצאו את תחומי החיוביות והשליליות של הפונקציה.
        ב. ידוע כי לפונקציה f(x) יש נקודת קיצון פנימית אחת ואין לה נקודות פיתול.
        סרטטו סקיצה של גרף הפונקציה.
        ג. הנקודה A נמצאת ברביע הראשון על גרף הפונקציה f(x).
        הנקודה C היא נקודת החיתוך של גרף הפונקציה עם החלק החיובי של ציר ה-x.
        מן הנקודה A העבירו שני אנכים:
        אחד לציר ה-x החותך אותו בנקודה B,
        ואנך נוסף לישר x = 1, החותך אותו בנקודה D.
        מצאו את שיעורי הנקודה A שבעבורה היקף המלבן ABCD הוא מקסימלי."""
    ]
}